<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Chronos 语言文件
    |--------------------------------------------------------------------------
    */

    'months' => [
        '一月', '二月', '三月', '四月', '五月', '六月',
        '七月', '八月', '九月', '十月', '十一月', '十二月'
    ],

    'months_short' => [
        '1月', '2月', '3月', '4月', '5月', '6月',
        '7月', '8月', '9月', '10月', '11月', '12月'
    ],

    'days' => [
        '星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六'
    ],

    'days_short' => [
        '周日', '周一', '周二', '周三', '周四', '周五', '周六'
    ],

    'days_min' => [
        '日', '一', '二', '三', '四', '五', '六'
    ],

    'relative' => [
        'before' => '前',
        'after' => '后',
        'just_now' => '刚刚',
        'a_minute' => '1分钟',
        'minutes' => '分钟',
        'an_hour' => '1小时',
        'hours' => '小时',
        'a_day' => '1天',
        'days' => '天',
        'a_week' => '1周',
        'weeks' => '周',
        'a_month' => '1个月',
        'months' => '个月',
        'a_year' => '1年',
        'years' => '年',
    ],

    'formats' => [
        'date' => 'Y年m月d日',
        'date_with_day' => 'Y年m月d日 D',
        'datetime' => 'Y年m月d日 H:i:s',
        'time' => 'H:i:s',
    ],
];
